<?xml version="1.0" encoding="UTF-8"?>
<update>
    <title>Update database for version 2.28</title>
    <queries>
      <query order="1">
          <![CDATA[
ALTER TABLE {cc_wiki} ADD auf_startseite_yn INT( 1 ) NOT NULL DEFAULT '0' AFTER text
]]>
      </query>
      <query order="2">
          <![CDATA[
ALTER TABLE {cc_cal_add} ADD with_repeat_yn INT( 1 ) NOT NULL DEFAULT '1' AFTER add_date
]]>
      </query>
      <query order="3">
          <![CDATA[
ALTER TABLE {cr_addition} ADD with_repeat_yn INT( 1 ) NOT NULL DEFAULT '1' AFTER add_date
]]>
      </query>
      <query order="4">
          <![CDATA[
ALTER TABLE {cdb_person} ADD spitzname VARCHAR( 30 ) NOT NULL AFTER vorname
]]>
      </query>
      <query order="5">
          <![CDATA[
update {cdb_feld} set sortkey=sortkey+1 where feldkategorie_id=1 and sortkey>=3
]]>
      </query>
      <query order="6">
          <![CDATA[
INSERT INTO {cdb_feld} VALUES(0, 1, 1, 'spitzname', NULL, 1, 'Spitzname', '', '(%) ', NULL, 30, 3)
]]>
      </query>
      <query order="7">
          <![CDATA[
ALTER TABLE {cdb_beziehungstyp} ADD sortkey INT( 11 ) NOT NULL
]]>
      </query>
      <query order="8">
          <![CDATA[
ALTER TABLE {cdb_person} ADD loginerrorcount INT( 11 ) NOT NULL AFTER lastlogin
]]>
      </query>
      <query order="9">
          <![CDATA[
insert into {cc_wiki} (doc_id, version_no, wikicategory_id, text) values ('Sicherheitsbestimmungen', 1, 0, '<p><strong>Verpflichtung auf das Datengeheimnis gem&auml;&szlig; &sect; 5 Bundesdatenschutzgesetz (BDSG), auf das Fernmeldegeheimnis gem&auml;&szlig; &sect; 88 Telekommunikationsgesetz (TKG) und auf Wahrung von Gesch&auml;ftsgeheimnissen</strong><br /> <br /> Hallo&nbsp;[Vorname]!<br /> Die pers&ouml;nlichen Daten unserer Mitarbeiter und Mitglieder wollen wir sch&uuml;tzen. Darum bitten wir Dich, Dich auf das Datengeheimnis wie folgt zu verpflichten:<br /> <br /> <strong>1. Verpflichtung auf das Datengeheimnis nach &sect; 5 BDSG</strong><br /> Aufgrund von &sect; 5 BDSG ist mir untersagt, personenbezogene Daten, die mir dienstlich bekannt werden, unbefugt zu erheben, zu verarbeiten oder zu nutzen. Dies gilt sowohl f&uuml;r die dienstliche T&auml;tigkeit innerhalb wie auch au&szlig;erhalb (z.B. bei Kunden und Interessenten) des Unternehmens/der Beh&ouml;rde.<br /> Die Pflicht zur Wahrung des Datengeheimnisses bleibt auch im Falle einer Versetzung oder nach Beendigung des Arbeits-/Dienstverh&auml;ltnisses bestehen.<br /> <br /> <strong>2. Verpflichtung auf das Fernmeldegeheimnis</strong><br /> Aufgrund von &sect; 88 TKG bin ich zur Wahrung des Fernmeldegeheimnisses verpflichtet, so- weit ich im Rahmen meiner T&auml;tigkeit bei der Erbringung gesch&auml;ftsm&auml;&szlig;iger Telekommunikationsdienste mitwirke.<br /> <br /> <strong>3. Verpflichtung auf Wahrung von Gesch&auml;ftsgeheimnissen</strong><br /> &Uuml;ber Angelegenheiten des Unternehmens, die beispielsweise Einzelheiten ihrer Organisation und ihre Einrichtung betreffen, sowie &uuml;ber Gesch&auml;ftsvorg&auml;nge und Zahlen des internen Rechnungswesens, ist auch nach Beendigung des Arbeitsverh&auml;ltnisses von mir Verschwiegenheit zu wahren, sofern sie nicht allgemein &ouml;ffentlich bekannt geworden sind. Hierunter fallen&nbsp;auch Vorg&auml;nge von Drittunternehmen, mit denen ich dienstlich befasst bin. Auf die gesetzli- chen Bestimmungen &uuml;ber unlauteren Wettbewerb wurde ich besonders hingewiesen.<br /> Alle dienstliche T&auml;tigkeiten betreffenden Aufzeichnungen, Abschriften, Gesch&auml;ftsunterlagen, Ablichtungen dienstlicher oder gesch&auml;ftlicher Vorg&auml;nge, die mir &uuml;berlassen oder von mir angefertigt werden, sind vor Einsichtnahme Unbefugter zu sch&uuml;tzen.<br /> <br /> Von diesen Verpflichtungen habe ich Kenntnis genommen. Ich bin mir bewusst, dass ich mich bei Verletzungen des Datengeheimnisses, des Fernmeldegeheimnisses oder von Gesch&auml;ftsgeheimnissen strafbar machen kann, insbesondere nach &sect;&sect; 44, 43 Abs. 2 BDSG, &sect; 206 Strafgesetzbuch (StGB) und nach &sect; 17 Gesetz gegen den unlauteren Wettbewerb (UWG).</p>')
]]>
      </query>
      <query order="10">
          <![CDATA[
insert into {cc_config} (name, value) values ('accept_datasecurity','0')
]]>
      </query>
      <query order="11">
          <![CDATA[
ALTER TABLE {cdb_person} ADD acceptedsecurity DATETIME NULL AFTER loginerrorcount
]]>
      </query>
    </queries>
</update>